import { Component } from '@angular/core';
import { NavController, NavParams, ViewController } from 'ionic-angular';

/**
 * Generated class for the DepartmentsPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

export interface department {
  title: string,
  body: string[],
}

@Component({
  selector: 'page-departments',
  templateUrl: 'departments.html',
})
export class DepartmentsPage {

  public allowed: boolean = false; 
  items: department[] = [];
  public wantedDep: department;

  constructor(public navCtrl: NavController, 
              public navParams: NavParams,
              public viewCtrl: ViewController) {
              let title = navParams.get('title');
              this.initializeItems();              
              for(let i = 0; i < this.items.length; i++) {
                console.log(this.items[i].title);
                if(this.items[i].title == title) {
                  this.wantedDep = this.items[i];
                  this.allowed = true;
                  break;
                }
              }              
  }

  ionViewDidLoad() {
    console.log('ionViewDidLoad DepartmentsPage');
  }

  initializeItems() {
    let dep1: department = {title: "", body: []};
    let dep2: department = {title: "", body: []};
    let dep3: department = {title: "", body: []};
    let dep4: department = {title: "", body: []};
    let dep5: department = {title: "", body: []};
    let dep6: department = {title: "", body: []};
    let dep7: department = {title: "", body: []};
    
    dep1.title = "מחלקת דוברות";
    dep1.body.push("על המחלקה: מחלקת דוברות אחראית על עדכון כלל הסטודנטים בפעילויות שנעשות בשוטף על ידי האגודה בכל המחלקות .");
    dep1.body.push("על הפרק:");
    dep1.body.push("ניהול דף הפייסבוק 'אגודת הסטודנטים בעזריאלי' הכולל : העלאת אלבומי תמונות מאירועים של אגודת הסטודנטים , העלאת פוסטים על פעילויות האגודה , עדכונים הודעות.");
    dep1.body.push("ניהול הדפים בפייסבוק 'Azrieli confessions'  ובנוסף 'Boardy'");
    dep1.body.push("ניהול דף אינסטגרם");
    dep1.body.push("הפצת מיילים");
    dep1.body.push("תליית פוסטרים ומודעות ברחבי המכללה");
    dep1.body.push("שם הרמ''ח : חן פרידמן");
    dep1.body.push(" מייל: dover.jce@gmail.com");
    this.items.push(dep1);
    dep2.title = "מחלקת ספורט";
    dep2.body.push("על המחלקה : מחלקת ספורט מספקת שלל פעילויות אשר יעלו לסדר היום את חשיבות הספורט לאורך חיים בריא וטוב. אנו חושבים שבאמצעות הספורט הסטודנטים יוכלו לפרוק לחצים, ישמחו וייהנו מזה ובכך יגיעו לתוצאות טובות יותר אם זה במבחנים וכמובן בחיים .");
    dep2.body.push("על הפרק :");
    dep2.body.push("טורניר פוקר -התקיים בתאריך 19.3 ובו חולקו  פרסים שווים !!");
    dep2.body.push("טורניר כדורגל  וטורניר כדורסל יוקרתיים חד יומיים מול כל המכללות בירושלים בשיתוף פעולה עם העירייה (לאחר מכן החלה ליגה עם אותן קבוצות )  ");
    dep2.body.push("תחרויות אס''א - פעם ראשונה בהיסטוריה של המכללה שהשתתפנו בתחרויות אלו (כמובן עם עוד הישג שלא שילמנו דמי השתתפות)  שלחנו קבוצת קט רגל שהגיעה עד השמינית גמר !!!!!");
    dep2.body.push("פורום של ספורט נשים בניסיון להגדיל את הספורט הנשי במכללה");
    dep2.body.push("הקרנות משחקים בפאבים בהנחה מיוחדת לסטודנטים שלנו ");
    dep2.body.push("עבודה מול חדרי כושר לשיתוף פעולה ");
    dep2.body.push("מתוכנן :");
    dep2.body.push("יום ספורט");
    dep2.body.push("שיעור ספורט במכללה לנשים (לפי בחירת הקהל וההיענות)");
    dep2.body.push("טורניר כדורגל  כדורסל וכדור עף פנימי של עזריאלי  בין מחלקות ");
    dep2.body.push("שם הרמ''ח : בני מזרחי");
    dep2.body.push("מייל: sport.jce@gmail.com");
    this.items.push(dep2);
    dep3.title = "מחלקת אקדמיה";
    dep3.body.push("על המחלקה : מחלקת האקדמיה דואגת לכל הקשור בפן האקדמי, טיפול בבעיות מול הסגל האקדמי ופיקוח כי חוקי התקנון מתקיימים.");
    dep3.body.push("על הפרק:");
    dep3.body.push("ייצוג בוועדות שונות:");
    dep3.body.push("ועדה אקדמית - לסטודנטים קול אחד בהחלטות המבנה האקדמאי במכללה, הכולל מינויי תפקידי סגל וראשי תחומים.");
    dep3.body.push("ועדת הוראה - לסטודנטים קול אחד בהחלטות ועדת הוראה למבנה התקנון האקדמאי, בוועדה זו נלחמת האגודה על התנאים הטובים ביותר לסטודנטים בפן האקדמי.");
    dep3.body.push("ועדת משמעת - בוועדה זו מסנגר נציג האגודה על סטודנטים אשר הועלו לוועדות משמעת בשל עבירות משמעת שונות.");
    dep3.body.push("פרויקטים לשנת 2017/18:");
    dep3.body.push("השאלת מחשבונים ומילוניות - ישנם המון סטודנטים שנתקעים רגע לפני מבחן ללא מחשבון או מילונית ואנו באגודת הסטודנטים נמצאים שם כדי שאף סטודנט לא ״יתקע״ במבחן.");
    dep3.body.push("דרופבוקס אגודתי - ישנם כל כך הרבה מאגרי מידע ברשת לכל מחלקה, אך אין מאגר מידע אחד גדול המאחד את הכל ואנו באגודה החלטנו לפתור זאת ובכך פתחנו את הענן הגדול ביותר לחברי האגודה בו מאוגד כל החומר מכל השנים הכולל סיכומים וחומר בלעדי.");
    dep3.body.push("מאגר המורים הפרטיים - המחשבה של פרויקט זה הינה לתווך בין הסטודנטים המצטיינים המעוניינים להעביר שיעור פרטי לבין סטודנטים המתקשים בחומר וכל זאת בסבסוד 50% משעת לימוד.");
    dep3.body.push("פרויקט המרתונים - כמו בכל שנה לפני כל סמסטר, אגודת הסטודנטים דואגת לכל הכיתות במכללה למרתון לימודי - 10 שעות אקדמאיות של תרגול מואץ בחומר ע״י המתרגלים הטובים ביותר וכל זאת במחיר מסובסד ע״י האגודה.");
    dep3.body.push("שם הרמ''ח : דנה פסח ");
    dep3.body.push("מייל:academy.jce@gmail.com");
    this.items.push(dep3);
    dep4.title = "מחלקת רווחה";
    dep4.body.push("על המחלקה: מחלקת רווחה פועלת לרווחת הסטודנטים תוך שמירה על תנאים סוציאליים במכללה ומחוצה לה.");
    dep4.body.push("על הפרק:");
    dep4.body.push("השאלת ערכות קפה למילואימניקים ");
    dep4.body.push("רכישת ארבעה/חמישה מיקרוגלים חדשים");
    dep4.body.push("מטריות ממותגות - שירות לחורץ . המטריות היו בעמדות העישון ובקבעי המעבר במכללה.");
    dep4.body.push("יום רווחה מכללתי");
    dep4.body.push("שדרוג פינת קפה אמון – רכישת 3 מכונות חדשות (קפה , תה , אספרסו/הפוך)");
    dep4.body.push("שם הרמ''ח : ספיר מרדכי ");
    dep4.body.push("מייל:revaha.jce@gmail.com");
    this.items.push(dep4);
    dep5.title = "מחלקת החברה הערבית";
    dep5.body.push("על המחלקה: מחלקה חדשה שהתחילה את פעילותה השנה.");
    dep5.body.push("המחלקה מייצגת את כל הסטודנטים מהחברה הערבית בכל הדברים שקשורים לאגודה.");
    dep5.body.push("על הפרק:");
    dep5.body.push("מילוניות אנגלית/ערבית");
    dep5.body.push("תרגום פוסטים ומיילים מעברית לערבית");
    dep5.body.push("מתוכנן:");
    dep5.body.push(".היעדרויות בחגים: חופש מהלימודים לכל המכללה בחגים הלא יהודיים");
    dep5.body.push("אפטאר גמאעי: ארוחת שבירת הצום ברמדאן שמתוכנן לתתקיים במכללה.");
    dep5.body.push("שם הרמ''ח : עלי חרבאווי");
    dep5.body.push("מייל: hevraArvit.jce@gmail.com");
    this.items.push(dep5);
    dep6.title = "מחלקת תרבות חוץ";
    dep6.body.push("על המחלקה: מטרת המחלקה היא שדרוג ההווי ותרבות החוץ מכללתית של הסטודנטים במכללה.");
    dep6.body.push("על הפרק:");
    dep6.body.push("מסיבת חנוכה – 'שובם של היוונים'");
    dep6.body.push("הרצאה על הבר");
    dep6.body.push("טיול אגודה – לכנרת שבו יהיה ספורט ימי וטיול ג'יפים");
    dep6.body.push("מתוכנן: ");
    dep6.body.push("מסיבת סוף שנה");
    dep6.body.push("להוציא הסעה לאולפן ליגת האלופות");
    dep6.body.push("שם הרמ''ח : אליאור יעקב ");
    dep6.body.push("מייל: tarbut2.jce@gmail.com");
    this.items.push(dep6);
    dep7.title = "מחלקת תרבות פנים";
    dep7.body.push("על המחלקה:  מחלקת תרבות פנים דואגת להווי החברתי במכללה , גיבוש הסטודנטים , ולשעה בשבוע לצאת מלחץ הסמסטר !");
    dep7.body.push("על הפרק:");
    dep7.body.push("Super break:");
    dep7.body.push("הפסקת 'בסמטאות עקבא'- הפסקה נוסח ערבי: בהפסקה חולקו פיתות דרוזיות , כנאפה, קפה, שתייה קלה. רחבת האירוע עוצבה בנוסח ערבי עם מחצלות ופופים. בהפסקה היה טורניר שש בש עם שני זוכים - מקום ראשון : ארוחה מלאה בג'קו סטריט, מקום שני: ארוחת קינוחים בוופל פקטורי.");
    dep7.body.push("הפסקת 'צ'ארלי בממלכת השוקולד' - הפסקה מלאה בשוקולד: בהפסקה היה דוכן ממתקים ודוכנים של וופל בלגי על מקל ופנקייקים אשר חולקו לאורך כל האירוע, רחבת האירוע עוצבה כמו היער הקסום של צ'ארלי בממלכת השוקולד.");
    dep7.body.push("הפסקת 'מפרץ הפיראטים' - הפסקה פיראטית ובה היה גלגל מזל שבו חולקו מתנות שוות למשתתפים - גאדג'טים , רחפן, צימרים, ופרס ראשון טלוויזיה סמסונג. רחבת האירוע עוצבה כספינת פיראטים. בנוסף חולקו מטבעות שוקולד ובירות.");
    dep7.body.push("Student break:");
    dep7.body.push("מדי כל שבוע נערכת הפסקה פעילה 'קטנה' בה יש פופקורן, סוכר מוזיקה ומשחקי חברה.");
    dep7.body.push("הפסקת פעילות: הייתה הפסקה בה עשינו פעילות של 'פוצץ את הבלון' ובה המשתתפים היו צריכים לפוצץ בלון בעזרת חץ במרחק של מטר וחצי, בכל פיצוץ של בלון נערכה הגרלת פרסים והמשתתף היה צריך לבחור פתק. בין הפרסים חולקו: מיני שש בש, פרס שני : מארז קינדר, פרס ראשון: ארוחה מלאה במוזס.");
    dep7.body.push("הפסקת 'Azrieli rave' -  הפסקת מסיבת רחוב: בהפסקה יהיה בר אשר יחולקו בו בירות, ארטיקים וטילונים, דיג'י מטורף ותפאורת מסיבת רחוב.");
    dep7.body.push("נרכש פיפא 18.");
    dep7.body.push("מתוכנן:");
    dep7.body.push("הפסקה 'מקסיקנה' - הפסקה בנוסח מקסיקו : בהפסקה יהיו דוכני מזון של טאקו\נאצ'וס, בירות קורונה, והשור הזועם עם פרסים.");
    dep7.body.push("אירוע סוף שנה: באירוע זה בעזרת השם יהיה אמן חושים ובירות.");
    dep7.body.push("שם הרמ''ח : נוי לוי");
    dep7.body.push("מייל: tarbut1.jce@gmail.com");
    this.items.push(dep7);
  }

}
